results/run-stages.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script-stages.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m30s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.3s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 001/100 VUs  0m00.3s/2m30.0s

running (0m01.4s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.4s/2m30.0s

running (0m02.3s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m02.3s/2m30.0s

running (0m03.4s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m03.4s/2m30.0s

running (0m04.3s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 001/100 VUs  0m04.3s/2m30.0s

running (0m05.4s), 001/100 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 001/100 VUs  0m05.4s/2m30.0s

running (0m06.3s), 001/100 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 001/100 VUs  0m06.3s/2m30.0s

running (0m07.4s), 001/100 VUs, 4 complete and 0 interrupted iterations
default   [   5% ] 001/100 VUs  0m07.4s/2m30.0s

running (0m08.4s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 002/100 VUs  0m08.4s/2m30.0s

running (0m09.3s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 002/100 VUs  0m09.3s/2m30.0s

running (0m10.4s), 002/100 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 002/100 VUs  0m10.4s/2m30.0s

running (0m11.4s), 002/100 VUs, 7 complete and 0 interrupted iterations
default   [   8% ] 002/100 VUs  0m11.4s/2m30.0s

running (0m12.3s), 002/100 VUs, 8 complete and 0 interrupted iterations
default   [   8% ] 002/100 VUs  0m12.3s/2m30.0s

running (0m13.3s), 002/100 VUs, 9 complete and 0 interrupted iterations
default   [   9% ] 002/100 VUs  0m13.3s/2m30.0s

running (0m14.3s), 002/100 VUs, 11 complete and 0 interrupted iterations
default   [  10% ] 002/100 VUs  0m14.3s/2m30.0s

running (0m15.3s), 003/100 VUs, 13 complete and 0 interrupted iterations
default   [  10% ] 003/100 VUs  0m15.3s/2m30.0s

running (0m16.3s), 003/100 VUs, 14 complete and 0 interrupted iterations
default   [  11% ] 003/100 VUs  0m16.3s/2m30.0s

running (0m17.3s), 003/100 VUs, 15 complete and 0 interrupted iterations
default   [  12% ] 003/100 VUs  0m17.3s/2m30.0s

running (0m18.3s), 003/100 VUs, 17 complete and 0 interrupted iterations
default   [  12% ] 003/100 VUs  0m18.3s/2m30.0s

running (0m19.3s), 003/100 VUs, 19 complete and 0 interrupted iterations
default   [  13% ] 003/100 VUs  0m19.3s/2m30.0s

running (0m20.3s), 003/100 VUs, 20 complete and 0 interrupted iterations
default   [  14% ] 003/100 VUs  0m20.3s/2m30.0s

running (0m21.3s), 003/100 VUs, 23 complete and 0 interrupted iterations
default   [  14% ] 003/100 VUs  0m21.3s/2m30.0s

running (0m22.4s), 003/100 VUs, 24 complete and 0 interrupted iterations
default   [  15% ] 003/100 VUs  0m22.4s/2m30.0s

running (0m23.3s), 004/100 VUs, 26 complete and 0 interrupted iterations
default   [  16% ] 004/100 VUs  0m23.3s/2m30.0s

running (0m24.3s), 004/100 VUs, 28 complete and 0 interrupted iterations
default   [  16% ] 004/100 VUs  0m24.3s/2m30.0s

running (0m25.4s), 004/100 VUs, 31 complete and 0 interrupted iterations
default   [  17% ] 004/100 VUs  0m25.4s/2m30.0s

running (0m26.3s), 004/100 VUs, 34 complete and 0 interrupted iterations
default   [  18% ] 004/100 VUs  0m26.3s/2m30.0s

running (0m27.3s), 004/100 VUs, 36 complete and 0 interrupted iterations
default   [  18% ] 004/100 VUs  0m27.3s/2m30.0s

running (0m28.3s), 004/100 VUs, 39 complete and 0 interrupted iterations
default   [  19% ] 004/100 VUs  0m28.3s/2m30.0s

running (0m29.3s), 004/100 VUs, 43 complete and 0 interrupted iterations
default   [  20% ] 004/100 VUs  0m29.3s/2m30.0s

running (0m30.3s), 005/100 VUs, 45 complete and 0 interrupted iterations
default   [  20% ] 005/100 VUs  0m30.3s/2m30.0s

running (0m31.3s), 005/100 VUs, 47 complete and 0 interrupted iterations
default   [  21% ] 005/100 VUs  0m31.3s/2m30.0s

running (0m32.4s), 005/100 VUs, 49 complete and 0 interrupted iterations
default   [  22% ] 005/100 VUs  0m32.4s/2m30.0s

running (0m33.4s), 006/100 VUs, 52 complete and 0 interrupted iterations
default   [  22% ] 006/100 VUs  0m33.4s/2m30.0s

running (0m34.3s), 006/100 VUs, 55 complete and 0 interrupted iterations
default   [  23% ] 006/100 VUs  0m34.3s/2m30.0s

running (0m35.4s), 007/100 VUs, 59 complete and 0 interrupted iterations
default   [  24% ] 007/100 VUs  0m35.4s/2m30.0s

running (0m36.3s), 007/100 VUs, 61 complete and 0 interrupted iterations
default   [  24% ] 007/100 VUs  0m36.3s/2m30.0s

running (0m37.3s), 008/100 VUs, 66 complete and 0 interrupted iterations
default   [  25% ] 008/100 VUs  0m37.3s/2m30.0s

running (0m38.3s), 008/100 VUs, 69 complete and 0 interrupted iterations
default   [  26% ] 008/100 VUs  0m38.3s/2m30.0s

running (0m39.3s), 008/100 VUs, 73 complete and 0 interrupted iterations
default   [  26% ] 008/100 VUs  0m39.3s/2m30.0s

running (0m40.3s), 009/100 VUs, 79 complete and 0 interrupted iterations
default   [  27% ] 009/100 VUs  0m40.3s/2m30.0s

running (0m41.4s), 009/100 VUs, 83 complete and 0 interrupted iterations
default   [  28% ] 009/100 VUs  0m41.4s/2m30.0s

running (0m42.4s), 010/100 VUs, 90 complete and 0 interrupted iterations
default   [  28% ] 010/100 VUs  0m42.4s/2m30.0s

running (0m43.3s), 010/100 VUs, 97 complete and 0 interrupted iterations
default   [  29% ] 010/100 VUs  0m43.3s/2m30.0s

running (0m44.3s), 010/100 VUs, 103 complete and 0 interrupted iterations
default   [  30% ] 010/100 VUs  0m44.3s/2m30.0s

running (0m45.3s), 011/100 VUs, 108 complete and 0 interrupted iterations
default   [  30% ] 011/100 VUs  0m45.3s/2m30.0s

running (0m46.4s), 011/100 VUs, 116 complete and 0 interrupted iterations
default   [  31% ] 011/100 VUs  0m46.4s/2m30.0s

running (0m47.3s), 012/100 VUs, 122 complete and 0 interrupted iterations
default   [  32% ] 012/100 VUs  0m47.3s/2m30.0s

running (0m48.3s), 012/100 VUs, 131 complete and 0 interrupted iterations
default   [  32% ] 012/100 VUs  0m48.3s/2m30.0s

running (0m49.3s), 013/100 VUs, 136 complete and 0 interrupted iterations
default   [  33% ] 013/100 VUs  0m49.3s/2m30.0s

running (0m50.3s), 013/100 VUs, 144 complete and 0 interrupted iterations
default   [  34% ] 013/100 VUs  0m50.3s/2m30.0s

running (0m51.3s), 013/100 VUs, 151 complete and 0 interrupted iterations
default   [  34% ] 013/100 VUs  0m51.3s/2m30.0s

running (0m52.3s), 014/100 VUs, 159 complete and 0 interrupted iterations
default   [  35% ] 014/100 VUs  0m52.3s/2m30.0s

running (0m53.3s), 014/100 VUs, 169 complete and 0 interrupted iterations
default   [  36% ] 014/100 VUs  0m53.3s/2m30.0s

running (0m54.4s), 015/100 VUs, 180 complete and 0 interrupted iterations
default   [  36% ] 015/100 VUs  0m54.4s/2m30.0s

running (0m55.3s), 015/100 VUs, 188 complete and 0 interrupted iterations
default   [  37% ] 015/100 VUs  0m55.3s/2m30.0s

running (0m56.3s), 015/100 VUs, 198 complete and 0 interrupted iterations
default   [  38% ] 015/100 VUs  0m56.3s/2m30.0s

running (0m57.3s), 016/100 VUs, 206 complete and 0 interrupted iterations
default   [  38% ] 016/100 VUs  0m57.3s/2m30.0s

running (0m58.3s), 016/100 VUs, 213 complete and 0 interrupted iterations
default   [  39% ] 016/100 VUs  0m58.3s/2m30.0s

running (0m59.3s), 017/100 VUs, 221 complete and 0 interrupted iterations
default   [  40% ] 017/100 VUs  0m59.3s/2m30.0s

running (1m00.3s), 017/100 VUs, 229 complete and 0 interrupted iterations
default   [  40% ] 017/100 VUs  1m00.3s/2m30.0s

running (1m01.3s), 018/100 VUs, 237 complete and 0 interrupted iterations
default   [  41% ] 018/100 VUs  1m01.3s/2m30.0s

running (1m02.3s), 018/100 VUs, 253 complete and 0 interrupted iterations
default   [  42% ] 018/100 VUs  1m02.3s/2m30.0s

running (1m03.3s), 018/100 VUs, 256 complete and 0 interrupted iterations
default   [  42% ] 018/100 VUs  1m03.3s/2m30.0s

running (1m04.3s), 019/100 VUs, 271 complete and 0 interrupted iterations
default   [  43% ] 019/100 VUs  1m04.3s/2m30.0s

running (1m05.3s), 019/100 VUs, 281 complete and 0 interrupted iterations
default   [  44% ] 019/100 VUs  1m05.3s/2m30.0s

running (1m06.3s), 020/100 VUs, 291 complete and 0 interrupted iterations
default   [  44% ] 020/100 VUs  1m06.3s/2m30.0s

running (1m07.4s), 020/100 VUs, 307 complete and 0 interrupted iterations
default   [  45% ] 020/100 VUs  1m07.4s/2m30.0s

running (1m08.3s), 020/100 VUs, 315 complete and 0 interrupted iterations
default   [  46% ] 020/100 VUs  1m08.3s/2m30.0s

running (1m09.3s), 021/100 VUs, 327 complete and 0 interrupted iterations
default   [  46% ] 021/100 VUs  1m09.3s/2m30.0s

running (1m10.3s), 021/100 VUs, 340 complete and 0 interrupted iterations
default   [  47% ] 021/100 VUs  1m10.3s/2m30.0s

running (1m11.3s), 022/100 VUs, 352 complete and 0 interrupted iterations
default   [  48% ] 022/100 VUs  1m11.3s/2m30.0s

running (1m12.3s), 022/100 VUs, 363 complete and 0 interrupted iterations
default   [  48% ] 022/100 VUs  1m12.3s/2m30.0s

running (1m13.3s), 023/100 VUs, 375 complete and 0 interrupted iterations
default   [  49% ] 023/100 VUs  1m13.3s/2m30.0s

running (1m14.3s), 023/100 VUs, 390 complete and 0 interrupted iterations
default   [  50% ] 023/100 VUs  1m14.3s/2m30.0s

running (1m15.4s), 023/100 VUs, 403 complete and 0 interrupted iterations
default   [  50% ] 023/100 VUs  1m15.4s/2m30.0s

running (1m16.3s), 024/100 VUs, 417 complete and 0 interrupted iterations
default   [  51% ] 024/100 VUs  1m16.3s/2m30.0s

running (1m17.3s), 024/100 VUs, 434 complete and 0 interrupted iterations
default   [  52% ] 024/100 VUs  1m17.3s/2m30.0s

running (1m18.3s), 025/100 VUs, 447 complete and 0 interrupted iterations
default   [  52% ] 025/100 VUs  1m18.3s/2m30.0s

running (1m19.3s), 025/100 VUs, 460 complete and 0 interrupted iterations
default   [  53% ] 025/100 VUs  1m19.3s/2m30.0s

running (1m20.3s), 025/100 VUs, 474 complete and 0 interrupted iterations
default   [  54% ] 025/100 VUs  1m20.3s/2m30.0s

running (1m21.4s), 026/100 VUs, 491 complete and 0 interrupted iterations
default   [  54% ] 026/100 VUs  1m21.4s/2m30.0s

running (1m22.3s), 026/100 VUs, 505 complete and 0 interrupted iterations
default   [  55% ] 026/100 VUs  1m22.3s/2m30.0s

running (1m23.3s), 027/100 VUs, 518 complete and 0 interrupted iterations
default   [  56% ] 027/100 VUs  1m23.3s/2m30.0s

running (1m24.3s), 027/100 VUs, 535 complete and 0 interrupted iterations
default   [  56% ] 027/100 VUs  1m24.3s/2m30.0s

running (1m25.3s), 028/100 VUs, 555 complete and 0 interrupted iterations
default   [  57% ] 028/100 VUs  1m25.3s/2m30.0s

running (1m26.3s), 028/100 VUs, 565 complete and 0 interrupted iterations
default   [  58% ] 028/100 VUs  1m26.3s/2m30.0s

running (1m27.3s), 028/100 VUs, 583 complete and 0 interrupted iterations
default   [  58% ] 028/100 VUs  1m27.3s/2m30.0s

running (1m28.3s), 029/100 VUs, 601 complete and 0 interrupted iterations
default   [  59% ] 029/100 VUs  1m28.3s/2m30.0s

running (1m29.3s), 029/100 VUs, 616 complete and 0 interrupted iterations
default   [  60% ] 029/100 VUs  1m29.3s/2m30.0s

running (1m30.3s), 030/100 VUs, 634 complete and 0 interrupted iterations
default   [  60% ] 030/100 VUs  1m30.3s/2m30.0s

running (1m31.3s), 033/100 VUs, 652 complete and 0 interrupted iterations
default   [  61% ] 033/100 VUs  1m31.3s/2m30.0s

running (1m32.4s), 035/100 VUs, 667 complete and 0 interrupted iterations
default   [  62% ] 035/100 VUs  1m32.4s/2m30.0s

running (1m33.3s), 037/100 VUs, 688 complete and 0 interrupted iterations
default   [  62% ] 037/100 VUs  1m33.3s/2m30.0s

running (1m34.3s), 040/100 VUs, 710 complete and 0 interrupted iterations
default   [  63% ] 040/100 VUs  1m34.3s/2m30.0s

running (1m35.3s), 042/100 VUs, 732 complete and 0 interrupted iterations
default   [  64% ] 042/100 VUs  1m35.3s/2m30.0s

running (1m36.3s), 044/100 VUs, 755 complete and 0 interrupted iterations
default   [  64% ] 044/100 VUs  1m36.3s/2m30.0s

running (1m37.3s), 047/100 VUs, 783 complete and 0 interrupted iterations
default   [  65% ] 047/100 VUs  1m37.3s/2m30.0s

running (1m38.3s), 049/100 VUs, 808 complete and 0 interrupted iterations
default   [  66% ] 049/100 VUs  1m38.3s/2m30.0s

running (1m39.3s), 051/100 VUs, 835 complete and 0 interrupted iterations
default   [  66% ] 051/100 VUs  1m39.3s/2m30.0s

running (1m40.3s), 054/100 VUs, 865 complete and 0 interrupted iterations
default   [  67% ] 054/100 VUs  1m40.3s/2m30.0s

running (1m41.3s), 056/100 VUs, 896 complete and 0 interrupted iterations
default   [  68% ] 056/100 VUs  1m41.3s/2m30.0s

running (1m42.3s), 058/100 VUs, 935 complete and 0 interrupted iterations
default   [  68% ] 058/100 VUs  1m42.3s/2m30.0s

running (1m43.3s), 061/100 VUs, 965 complete and 0 interrupted iterations
default   [  69% ] 061/100 VUs  1m43.3s/2m30.0s

running (1m44.3s), 063/100 VUs, 1003 complete and 0 interrupted iterations
default   [  70% ] 063/100 VUs  1m44.3s/2m30.0s

running (1m45.3s), 065/100 VUs, 1046 complete and 0 interrupted iterations
default   [  70% ] 065/100 VUs  1m45.3s/2m30.0s

running (1m46.3s), 068/100 VUs, 1090 complete and 0 interrupted iterations
default   [  71% ] 068/100 VUs  1m46.3s/2m30.0s

running (1m47.3s), 070/100 VUs, 1128 complete and 0 interrupted iterations
default   [  72% ] 070/100 VUs  1m47.3s/2m30.0s

running (1m48.3s), 072/100 VUs, 1176 complete and 0 interrupted iterations
default   [  72% ] 072/100 VUs  1m48.3s/2m30.0s

running (1m49.3s), 075/100 VUs, 1211 complete and 0 interrupted iterations
default   [  73% ] 075/100 VUs  1m49.3s/2m30.0s

running (1m50.3s), 077/100 VUs, 1256 complete and 0 interrupted iterations
default   [  74% ] 077/100 VUs  1m50.3s/2m30.0s

running (1m51.3s), 079/100 VUs, 1308 complete and 0 interrupted iterations
default   [  74% ] 079/100 VUs  1m51.3s/2m30.0s

running (1m52.3s), 082/100 VUs, 1361 complete and 0 interrupted iterations
default   [  75% ] 082/100 VUs  1m52.3s/2m30.0s

running (1m53.3s), 084/100 VUs, 1412 complete and 0 interrupted iterations
default   [  76% ] 084/100 VUs  1m53.3s/2m30.0s

running (1m54.3s), 086/100 VUs, 1454 complete and 0 interrupted iterations
default   [  76% ] 086/100 VUs  1m54.3s/2m30.0s

running (1m55.3s), 089/100 VUs, 1509 complete and 0 interrupted iterations
default   [  77% ] 089/100 VUs  1m55.3s/2m30.0s

running (1m56.3s), 091/100 VUs, 1564 complete and 0 interrupted iterations
default   [  78% ] 091/100 VUs  1m56.3s/2m30.0s

running (1m57.3s), 093/100 VUs, 1618 complete and 0 interrupted iterations
default   [  78% ] 093/100 VUs  1m57.3s/2m30.0s

running (1m58.3s), 096/100 VUs, 1675 complete and 0 interrupted iterations
default   [  79% ] 096/100 VUs  1m58.3s/2m30.0s

running (1m59.3s), 098/100 VUs, 1732 complete and 0 interrupted iterations
default   [  80% ] 098/100 VUs  1m59.3s/2m30.0s

running (2m00.3s), 100/100 VUs, 1801 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m00.3s/2m30.0s

running (2m01.3s), 100/100 VUs, 1859 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m01.3s/2m30.0s

running (2m02.3s), 096/100 VUs, 1923 complete and 0 interrupted iterations
default   [  82% ] 096/100 VUs  2m02.3s/2m30.0s

running (2m03.3s), 090/100 VUs, 1995 complete and 0 interrupted iterations
default   [  82% ] 090/100 VUs  2m03.3s/2m30.0s

running (2m04.3s), 088/100 VUs, 2051 complete and 0 interrupted iterations
default   [  83% ] 088/100 VUs  2m04.3s/2m30.0s

running (2m05.3s), 085/100 VUs, 2102 complete and 0 interrupted iterations
default   [  84% ] 085/100 VUs  2m05.3s/2m30.0s

running (2m06.3s), 081/100 VUs, 2167 complete and 0 interrupted iterations
default   [  84% ] 081/100 VUs  2m06.3s/2m30.0s

running (2m07.3s), 078/100 VUs, 2220 complete and 0 interrupted iterations
default   [  85% ] 078/100 VUs  2m07.3s/2m30.0s

running (2m08.3s), 077/100 VUs, 2273 complete and 0 interrupted iterations
default   [  86% ] 077/100 VUs  2m08.3s/2m30.0s

running (2m09.4s), 074/100 VUs, 2316 complete and 0 interrupted iterations
default   [  86% ] 074/100 VUs  2m09.4s/2m30.0s

running (2m10.3s), 071/100 VUs, 2364 complete and 0 interrupted iterations
default   [  87% ] 071/100 VUs  2m10.3s/2m30.0s

running (2m11.3s), 069/100 VUs, 2409 complete and 0 interrupted iterations
default   [  88% ] 069/100 VUs  2m11.3s/2m30.0s

running (2m12.3s), 062/100 VUs, 2458 complete and 0 interrupted iterations
default   [  88% ] 062/100 VUs  2m12.3s/2m30.0s

running (2m13.3s), 059/100 VUs, 2497 complete and 0 interrupted iterations
default   [  89% ] 059/100 VUs  2m13.3s/2m30.0s

running (2m14.3s), 058/100 VUs, 2533 complete and 0 interrupted iterations
default   [  90% ] 058/100 VUs  2m14.3s/2m30.0s

running (2m15.3s), 053/100 VUs, 2573 complete and 0 interrupted iterations
default   [  90% ] 053/100 VUs  2m15.3s/2m30.0s

running (2m16.3s), 048/100 VUs, 2609 complete and 0 interrupted iterations
default   [  91% ] 048/100 VUs  2m16.3s/2m30.0s

running (2m17.3s), 045/100 VUs, 2636 complete and 0 interrupted iterations
default   [  92% ] 045/100 VUs  2m17.3s/2m30.0s

running (2m18.3s), 040/100 VUs, 2669 complete and 0 interrupted iterations
default   [  92% ] 040/100 VUs  2m18.3s/2m30.0s

running (2m19.3s), 038/100 VUs, 2691 complete and 0 interrupted iterations
default   [  93% ] 038/100 VUs  2m19.3s/2m30.0s

running (2m20.3s), 036/100 VUs, 2712 complete and 0 interrupted iterations
default   [  94% ] 036/100 VUs  2m20.3s/2m30.0s

running (2m21.4s), 033/100 VUs, 2734 complete and 0 interrupted iterations
default   [  94% ] 033/100 VUs  2m21.4s/2m30.0s

running (2m22.4s), 028/100 VUs, 2759 complete and 0 interrupted iterations
default   [  95% ] 028/100 VUs  2m22.4s/2m30.0s

running (2m23.3s), 028/100 VUs, 2773 complete and 0 interrupted iterations
default   [  96% ] 028/100 VUs  2m23.3s/2m30.0s

running (2m24.3s), 022/100 VUs, 2794 complete and 0 interrupted iterations
default   [  96% ] 022/100 VUs  2m24.3s/2m30.0s

running (2m25.3s), 020/100 VUs, 2808 complete and 0 interrupted iterations
default   [  97% ] 020/100 VUs  2m25.3s/2m30.0s

running (2m26.4s), 016/100 VUs, 2819 complete and 0 interrupted iterations
default   [  98% ] 016/100 VUs  2m26.4s/2m30.0s

running (2m27.3s), 012/100 VUs, 2832 complete and 0 interrupted iterations
default   [  98% ] 012/100 VUs  2m27.3s/2m30.0s

running (2m28.3s), 010/100 VUs, 2840 complete and 0 interrupted iterations
default   [  99% ] 010/100 VUs  2m28.3s/2m30.0s

running (2m29.3s), 005/100 VUs, 2849 complete and 0 interrupted iterations
default   [ 100% ] 005/100 VUs  2m29.3s/2m30.0s

running (2m30.3s), 002/100 VUs, 2852 complete and 0 interrupted iterations
default ↓ [ 100% ] 003/100 VUs  2m30s


  █ TOTAL RESULTS 

    checks_total.......: 2854    18.944612/s
    checks_succeeded...: 100.00% 2854 out of 2854
    checks_failed......: 0.00%   0 out of 2854

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=283.42ms min=54.74ms med=223.4ms max=3.59s p(90)=752.97ms p(95)=948.85ms
      { expected_response:true }...: avg=283.42ms min=54.74ms med=223.4ms max=3.59s p(90)=752.97ms p(95)=948.85ms
    http_req_failed................: 0.00%  0 out of 5708
    http_reqs......................: 5708   37.889225/s

    EXECUTION
    iteration_duration.............: avg=1.62s    min=1.27s   med=1.51s   max=5.9s  p(90)=2.2s     p(95)=2.4s    
    iterations.....................: 2854   18.944612/s
    vus............................: 2      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 11 MB  75 kB/s
    data_sent......................: 606 kB 4.0 kB/s



running (2m30.6s), 000/100 VUs, 2854 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m30s